# Вам доступен словарь my_dict. Напишите программу, которая выводит сумму минимального и максимального ключа в словаре my_dict.
#
# Примечание. Считайте, что словарь my_dict уже объявлен в вашей программе, и вы имеете к нему доступ.
#
#  Sample Input 1:
#
# my_dict = {1: 'a', 2: 'b', 3: 'c', 4: 'd', 5: 'e'}
#
# Sample Output 1:
#
# 6
#
# Sample Input 2:
#
# my_dict = {0.5: 'apple', 2: 'banana', -3.57: 'orange'}
#
# Sample Output 2:
#
# -1.57


my_dict = {1.12: 'aa', 67.9: 45, 3.11: 'ccc', 7.9: 'dd', 9.2: 'ee', 7.1: 'ff', 0.12: 'qq', 1.91: 'aa', 10.12: [1, 2, 3], 99.0: {9, 0, 1}}

print(min(my_dict) + max(my_dict))
