# Вам доступно множество numbers. Напишите программу, которая выводит среднее арифметическое элементов множества numbers.
#
# Примечание. Считайте, что множество numbers уже объявлено в вашей программе, и вы имеете к нему доступ.
#
#  Sample Input 1:
#
# numbers = {10, 2, -0.5, -7, 82, 12, -4.23}
#
# Sample Output 1:
#
# 13.467142857142857
#
# Sample Input 2:
#
# numbers = {3, 4, -8.2, 41, -1.8, 25.5, 10.5, -2, 3}
#
# Sample Output 2:
#
# 9.0


numbers = {20, 6, 8, 18, 18, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 12, 8, 8, 10, 4, 2, 2, 2, 16, 20}
average = sum(numbers)/len(numbers)

print(average)
