# Список по образцу 1
# 
# На вход программе подается число nn. Напишите программу, которая создает и выводит построчно список, состоящий из nn списков [[1, 2, ..., n], [1, 2, ..., n], ..., [1, 2, ..., n]].
# 
# Формат входных данных
# На вход программе подается натуральное число nn.
# 
# Формат выходных данных
# Программа должна вывести построчно указанный список.
# 
# 
# 
# Sample Input 1:
# 
# 3
# 
# Sample Output 1:
# 
# [1, 2, 3]
# [1, 2, 3]
# [1, 2, 3]
# 
# Sample Input 2:
# 
# 2
# 
# Sample Output 2:
# 
# [1, 2]
# [1, 2]
# 
# Sample Input 3:
# 
# 5
# 
# Sample Output 3:
# 
# [1, 2, 3, 4, 5]
# [1, 2, 3, 4, 5]
# [1, 2, 3, 4, 5]
# [1, 2, 3, 4, 5]
# [1, 2, 3, 4, 5]

# put your python code here
row_len = int(input())
matrix = [[i for i in range(1, row_len + 1)] for _ in range(row_len)]
for i in matrix:
    print(i)

