# Вам доступен список numbers. Используя генератор словарей, напишите программу, которая выводит словарь, где ключами будут элементы списка numbers, а значениями – отсортированные по возрастанию списки всех делителей этих элементов, начиная с 11.
#
# Примечание 1. Считайте, что список numbers уже объявлен в вашей программе, и вы имеете к нему доступ.
#
# Примечание 2. Порядок элементов в результирующем словаре не учитывается.
#
#  Sample Input 1:
#
# numbers = [1, 6, 18]
#
# Sample Output 1:
#
# {1: [1], 6: [1, 2, 3, 6], 18: [1, 2, 3, 6, 9, 18]}
#
# Sample Input 2:
#
# numbers = [24, 5, 17, 9, 28, 84, 62]
#
# Sample Output 2:
#
# {
#     24: [1, 2, 3, 4, 6, 8, 12, 24], 5: [1, 5], 17: [1, 17], 9: [1, 3, 9],
#     28: [1, 2, 4, 7, 14, 28], 84: [1, 2, 3, 4, 6, 7, 12, 14, 21, 28, 42, 84],
#     62: [1, 2, 31, 62],
# }

 Sample Input 1:

numbers = [1, 6, 18]

Sample Output 1:

{1: [1], 6: [1, 2, 3, 6], 18: [1, 2, 3, 6, 9, 18]}

Sample Input 2:

numbers = [24, 5, 17, 9, 28, 84, 62]

Sample Output 2:

{
    24: [1, 2, 3, 4, 6, 8, 12, 24], 5: [1, 5], 17: [1, 17], 9: [1, 3, 9],
    28: [1, 2, 4, 7, 14, 28], 84: [1, 2, 3, 4, 6, 7, 12, 14, 21, 28, 42, 84],
    62: [1, 2, 31, 62],
}