# Вам доступен кортеж numbers. Напишите программу, которая выводит список, содержащий средние арифметические значения чисел каждого вложенного кортежа в заданном кортеже кортежей numbers.
#
# Примечание. Считайте, что кортеж numbers уже объявлен в вашей программе, и вы имеете к нему доступ.
#
# Sample Input 1:
#
# numbers = ((10, 10, 10, 12), (30, 45, 56, 45), (81, 80, 39, 32), (1, 2, 3, 4), (90, 10))
#
# Sample Output 1:
#
# [10.5, 44.0, 58.0, 2.5, 50.0]
#
# Sample Input 2:
#
# numbers = ((-5, 5, 3), (2,), (1, -1), (7, 6, 5), (8, 10, 14, 20))
#
# Sample Output 2:
#
[1.0, 2.0, 0.0, 6.0, 13.0]


numbers = ((10, 10, 10, 12), (30, 45, 56, 45), (81, 80, 39, 32), (1, 2, 3, 4), (90, 10))
result_list = []
for i in range(len(numbers)):
    sum = 0
    for j in range(len(numbers[i])):
        sum += numbers[i][j]
    result_list.append(sum / len(numbers[i]))
print(result_list)
