# Вам доступен кортеж primes. Напишите программу, которая выводит первые 66 элементов кортежа primes.
#
# Примечание. Считайте, что кортеж primes уже объявлен в вашей программе, и вы имеете к нему доступ.
#
# Sample Input 1:
#
# primes = (2, 3, 5, 7, 11, 13, 17, 19, 23, 29)
#
# Sample Output 1:
#
# (2, 3, 5, 7, 11, 13)
#
# Sample Input 2:
#
# primes = (31, 37, 41, 43, 47, 53, 59, 61, 67, 71)
#
# Sample Output 2:
#
# (31, 37, 41, 43, 47, 53)


primes = (2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71)
print(primes[:6])
