# Калькулятор доставки 🛵
#
# Интернет-магазин осуществляет экспресс доставку для своих товаров по цене 10001000 рублей за первый товар и 120120 рублей за каждый последующий товар. Напишите функцию get_shipping_cost(quantity), которая принимает в качестве аргумента натуральное число quantity – количество товаров в заказе – и возвращает стоимость доставки.
#
# Примечание. Приведённый ниже код:
#
# print(get_shipping_cost(1))
# print(get_shipping_cost(3))
#
# должен выводить:
#
# 1000
# 1240
#
#
# Sample Input 1:
#
# 1
#
# Sample Output 1:
#
# 1000
#
# Sample Input 2:
#
# 2
#
# Sample Output 2:
#
# 1120

# объявление функции
def get_shipping_cost(quantity):
    return 1000 + 120 * (quantity - 1)

# считываем данные
n = int(input())

# вызываем функцию
print(get_shipping_cost(n))
